{"pageProps":{"data":{"title":"How to use marks in nvim","excerpt":"Speed up the your development using marks in nvim","date":"2024-05-03T19:35:07.322Z","draft":false,"tags":["vim","nvim","marks"]},"content":"\n# Intro\n\nGoing to cover marks in nvim, which could also be thought of as bookmarks. Marks is a core vim feature, so it doesn't require any special plugins. The marks feature allows us to easily move / jump around important points in a file (or in different files).\n\n# How I use it?\n\nAs a developer; I would be working on a feature, the code for which would span across multiple files. I would create marks for certain positions in a single file or across multiple files. This would help me jump around these positions, saving me countless minutes in switching between the files if I had to do it manually.\n\nMarks are used on the normal mode. So if I use `m` followed by a character, let's say `a`, it would mark the exact location. I can view the existing marks by using the `:marks` command. The uppercase marks `'A` to `'Z` include the file name. So kind of a global mark. I use it to jump across files.\n\nSince I use telescope I could also see all my marks in the telescope window. I also see a small preview of where my marks are. I could also move on the list to choose the mark I want. \n\n### Deleting marks\n\nI rarely delete marks. Lowercase marks `'a` to `'z` are remembered as long as the file remains in the buffer list. If the file is removed from the buffer list, all its marks are lost. If the line containing the mark is deleted, the mark is erased. They are also restored when using undo and redo.\n\n### Using operators along with marks\n\nThe lowercase marks can be used in combination with operators as well. For example: `d't` would delete the lines from the cursor position to the mark `t`. Generally I would use mark `t` for top and `b` for bottom etc.\n\n# List of commands useful for marks\n\n```shell\nCommand       | Operation\n--------------|----------------------------------------------------------\nm{a-zA-Z}     | Sets the mark, for example `ma`\n'a            | Go to the mark set at `a`, the cursor would be positioned on the first non-blank character in the line\n`a            | Go to the mark set at `a`, the cursor would be positioned on the exact location\n]'            | Go to the next lowercase mark set, cursor positioned on the first non-blank character in the line\n]`            | Go to the next lowercase mark set, cursor positioned on the exact location\n['            | Go to the previous lowercase mark set, cursor positioned on the first non-blank character in the line\n[`            | Go to the previous lowercase mark set, cursor positioned on the exact location\n:marks        | Shows the list of marks\n:marks a      | Shows the list of mark at a\n:marks ab     | Shows the list of marks at a and b\n:marks a-c    | Shows the list of marks at a, b and c\n:delmarks a   | Deletes the mark at a\n:delmarks ab  | Deletes the mark at a and b\n:delmarks a-c | Deletes the mark at a, b and c\n:delmarks!    | Deletes all marks for current buffer (with lowercase {a-z})\n```\n\n# References and further reading\n1. [Marks in Vim Are A Game Changer](https://www.youtube.com/watch/XT_kFia3Ua4)\n2. [Marks & Folds - Vim Tips (5)](https://www.youtube.com/watch?v=ovRqGybIg1Q&ab_channel=BenKadel)\n3. :help marks\n4. [Plugin to view marks on the sign column](https://github.com/chentoast/marks.nvim)\n\n### Further reading, related topics\n1. Jumps\n2. Changes\n","slug":"nvim-marks"},"__N_SSG":true}